//拓扑排序

//首先拓扑序列是针对有向图来说的，无向图是没有拓扑序列的 

//每条边起点都在终点的前面，有环的话，找不到拓扑序

//可以证明有向无环图被称为拓扑图 
 
bool topsort(){
	int hh = 0, tt = -1; // 这里用到了定义队列的操作
	 
	//d[i]储存点i的入度
	for (int i = 1; i <= n; i++){
		if (!d[i]){ //如果他的入度是0的话，就把他入队,就是找到起点 
			q[++tt] = i;
	} 
	while(hh <= tt){
		int t = q[hh++];
		for (int i = h[t]; i != -1; i++){
			int j = e[i];
			if (--d[j] == 0){ //如果他的入度为0的话，就让他进队列 
				q[++tt] = j;
			}
		}
	}
	//如果所有点都入队了，说明存在拓扑序
	return tt == n - 1; 
} 
//此时队列里存的就是一组拓扑序列 
