//dp问题，dp问题是没啥模板的， 这里能够给你的就是一些经典题目

//dp问题最主要的就是去递推状态转移方程，而且要注意边界问题，所以大家这一块要是想要攻破dp的话，没有大量的刷题基本不可能 

//dp可以这么来表示，一个是状态表示， 一个是状态表示， 一个是集合划分

//先说状态表示(在这里以经典的背包问题举例)：
//1.先来说状态表示f(i, j) 
		//集合 
				//1) 所有选法
				//2) 条件：
						//1)只从前i个物品选
						//2)总体积 <= j 
		//属性
				//:Max, Min数量
				 
//2.再来说状态计算-集合划分
//f(i, j) = Max(f(i - 1, j) , f(i - 1, j - vi) + wi)

//建议去搜背包九讲，会比我的详细很多，这类博客也很多，没有再复线一遍的意义
//在这里给大家一个地址:上面有特别详细的解释：
//https://blog.csdn.net/yandaoqiusheng/article/details/84782655 

